---
kind: type
id: T:Autodesk.Revit.UI.TableViewUIUtils
source: html/fa8b5de3-34e7-aa77-d2ae-9862d6ec772d.htm
---
# Autodesk.Revit.UI.TableViewUIUtils

This utility class contains members that involve the Revit UI and operate on schedule views or MEP electrical panel schedules.

## Syntax (C#)
```csharp
public static class TableViewUIUtils
```